---
kind: method
id: M:Autodesk.Revit.DB.ExportFontInfo.#ctor(System.String)
source: html/10bca5e3-a5f0-2146-f5a1-e75fbb3e9227.htm
---
# Autodesk.Revit.DB.ExportFontInfo.#ctor Method

Constructs a new ExportFontInfo using the destination font name as input.

## Syntax (C#)
```csharp
public ExportFontInfo(
	string destinationFontName
)
```

## Parameters
- **destinationFontName** (`System.String`) - The destination font name (the name of the font in the exported format).

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null